state = True
money = 0
while state:
    print('****************【创始村电子商城】*****************')
    print('尊敬的用户您好，本商城有如下商品，请自行选购')
    print('**************************************************')
    print('------------【探险装备】------------')
    print('登山鞋，防水衣，探险背包，攀登绳，指南针')
    print('------------【各地美食】------------')
    print('东坡肉，烤鸭，肠粉，椰子鸡，锅包肉，烤馕')
    print('------------【休闲零食】------------')
    print('薯片，虾片，辣条，锅巴，果冻，牛奶，巧克力')
    print('*********************【退出】*********************')
    goods = input('商品名称：')
    if goods == '烤鸭':
        print('价格198')
        buy = input('是否购买：')
        if buy == '是':
            print('消费：198')
            money = money + 198
    if goods == '退出':
        state = False
        print('总价格：', money)
